kopiro/esp8266-deerma-humidifier/src/main.cpp
#include "Arduino.h"
#include <ArduinoJson.h>
#include <ArduinoOTA.h>
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <PubSubClient.h>
#include <WiFiManager.h>
#include <SoftwareSerial.h>

/*
Firmware documentation:
https://iot.mi.com/new/doc/embedded-development/wifi/module-dev/serial-communication
*/

#define SOFTWARE_VERSION "2025.04.03"

#define FLASH_PIN 0
#define STATUS_PIN 16

#define MQTT_POLLING_TIMEOUT 60000

SoftwareSerial SerialDebug(3, 1);

unsigned long currentTime = millis();

#define BOARD_PREFIX "esp8266-deerma-humidifier"

char mqtt_server[64] = "";
char mqtt_username[64] = "";
char mqtt_password[64] = "";

String BOARD_ID;

String MQTT_TOPIC_STATE;
String MQTT_TOPIC_COMMAND;
String MQTT_TOPIC_DEBUG;
String MQTT_TOPIC_AVAILABILITY;

String MQTT_TOPIC_AUTOCONF_HUMIDITY_SENSOR;
String MQTT_TOPIC_AUTOCONF_TEMPERATURE_SENSOR;
String MQTT_TOPIC_AUTOCONF_WIFI_SENSOR;
String MQTT_TOPIC_AUTOCONF_WATER_TANK_SENSOR;
String MQTT_TOPIC_AUTOCONF_HUMIDIFIER;
String MQTT_TOPIC_AUTOCONF_SOUND_SWITCH;
String MQTT_TOPIC_AUTOCONF_LED_SWITCH;

WiFiManager wifiManager;
WiFiClient wifiClient;
PubSubClient mqttClient;

WiFiManagerParameter wifi_param_mqtt_server("server", "MQTT server",
                                            mqtt_server,
                                            sizeof(mqtt_server));
WiFiManagerParameter wifi_param_mqtt_username("user", "MQTT username",
                                              mqtt_username,
                                              sizeof(mqtt_username));
WiFiManagerParameter wifi_param_mqtt_password("pass", "MQTT password",
                                              mqtt_password,
                                              sizeof(mqtt_password));

enum humMode_t { unknown = -1, low = 1, medium = 2, high = 3, setpoint = 4 };
struct humidifierState_t {
  boolean powerOn;

  humMode_t mode = (humMode_t)-1;

  int humiditySetpoint = -1;

  int currentHumidity = -1;
  int currentTemperature = -1;

  boolean soundEnabled;
  boolean ledEnabled;

  boolean waterTankInstalled;
  boolean waterTankEmpty;
};

// Global state
humidifierState_t state;

unsigned long mqttLastTime = millis();

void sendMQTTMessage(String topic, String message, bool retained) {
  SerialDebug.printf("MQTT message - topic: <%s>, message: <%s> -> ", topic,
                     message);
  if (mqttClient.publish(topic.c_str(), message.c_str(), retained)) {
    SerialDebug.println("sent");
  } else {
    SerialDebug.println("error");
  }
}




void sendHAAutoDiscovery() {
  char mqttPayload[2048];
  DynamicJsonDocument device(256);
  DynamicJsonDocument autoconfPayload(1024);
  StaticJsonDocument<64> identifiersDoc;
  JsonArray identifiers = identifiersDoc.to<JsonArray>();

  identifiers.add(BOARD_ID);

  device["identifiers"] = identifiers;
  device["manufacturer"] = "Deerma";
  device["model"] = "Mi Smart Antibacterial Humidifier";
  device["name"] = BOARD_ID;
  device["sw_version"] = SOFTWARE_VERSION;

  autoconfPayload["device"] = device.as<JsonObject>();
  autoconfPayload["availability_topic"] = MQTT_TOPIC_AVAILABILITY;
  autoconfPayload["state_topic"] = MQTT_TOPIC_STATE;
  autoconfPayload["name"] = BOARD_ID + String(" Humidity");
  autoconfPayload["device_class"] = "humidity";
  autoconfPayload["unit_of_measurement"] = "%";
  autoconfPayload["value_template"] = "{{value_json.humidity}}";
  autoconfPayload["unique_id"] = BOARD_ID + String("_humidity");

  serializeJson(autoconfPayload, mqttPayload);
  sendMQTTMessage(MQTT_TOPIC_AUTOCONF_HUMIDITY_SENSOR, mqttPayload, true);

  autoconfPayload.clear();

  autoconfPayload["device"] = device.as<JsonObject>();
  autoconfPayload["availability_topic"] = MQTT_TOPIC_AVAILABILITY;
  autoconfPayload["state_topic"] = MQTT_TOPIC_STATE;
  autoconfPayload["name"] = BOARD_ID + String(" Temperature");
  autoconfPayload["device_class"] = "temperature";
  autoconfPayload["unit_of_measurement"] = "°C";
  autoconfPayload["value_template"] = "{{value_json.temperature}}";
  autoconfPayload["unique_id"] = BOARD_ID + String("_temperature");

  serializeJson(autoconfPayload, mqttPayload);
  sendMQTTMessage(MQTT_TOPIC_AUTOCONF_TEMPERATURE_SENSOR, mqttPayload, true);

  autoconfPayload.clear();

  autoconfPayload["device"] = device.as<JsonObject>();
  autoconfPayload["availability_topic"] = MQTT_TOPIC_AVAILABILITY;
  autoconfPayload["state_topic"] = MQTT_TOPIC_STATE;
  autoconfPayload["name"] = BOARD_ID + String(" WiFi");
  autoconfPayload["value_template"] = "{{value_json.wifi.rssi}}";
  autoconfPayload["unique_id"] = BOARD_ID + String("_wifi");
  autoconfPayload["unit_of_measurement"] = "dBm";
  autoconfPayload["json_attributes_topic"] = MQTT_TOPIC_STATE;
  autoconfPayload["json_attributes_template"] =
      "{\"ssid\": \"{{value_json.wifi.ssid}}\", \"ip\": "
      "\"{{value_json.wifi.ip}}\"}";
  autoconfPayload["icon"] = "mdi:wifi";
  autoconfPayload["entity_category"] = "diagnostic";

  serializeJson(autoconfPayload, mqttPayload);
  sendMQTTMessage(MQTT_TOPIC_AUTOCONF_WIFI_SENSOR, mqttPayload, true);

  autoconfPayload.clear();

  autoconfPayload["device"] = device.as<JsonObject>();
  autoconfPayload["availability_topic"] = MQTT_TOPIC_AVAILABILITY;
  autoconfPayload["state_topic"] = MQTT_TOPIC_STATE;
  autoconfPayload["name"] = BOARD_ID + String(" Water Tank");
  autoconfPayload["value_template"] = "{{value_json.waterTank}}";
  autoconfPayload["unique_id"] = BOARD_ID + String("_water_tank");
  autoconfPayload["icon"] = "mdi:cup-water";
  autoconfPayload["entity_category"] = "diagnostic";

  serializeJson(autoconfPayload, mqttPayload);
  sendMQTTMessage(MQTT_TOPIC_AUTOCONF_WATER_TANK_SENSOR, mqttPayload, true);

  autoconfPayload.clear();

  autoconfPayload["device"] = device.as<JsonObject>();
  autoconfPayload["availability_topic"] = MQTT_TOPIC_AVAILABILITY;
  autoconfPayload["state_topic"] = MQTT_TOPIC_STATE;
  autoconfPayload["command_topic"] = MQTT_TOPIC_COMMAND;
  autoconfPayload["name"] = BOARD_ID + String(" Sound");
  autoconfPayload["value_template"] = "{{value_json.sound}}";
  autoconfPayload["unique_id"] = BOARD_ID + String("_sound");
  autoconfPayload["payload_on"] = "{\"sound\": \"on\"}";
  autoconfPayload["payload_off"] = "{\"sound\": \"off\"}";
  autoconfPayload["state_on"] = "on";
  autoconfPayload["state_off"] = "off";
  autoconfPayload["icon"] = "mdi:volume-high";
  autoconfPayload["entity_category"] = "config";

  serializeJson(autoconfPayload, mqttPayload);
  sendMQTTMessage(MQTT_TOPIC_AUTOCONF_SOUND_SWITCH, mqttPayload, true);

  autoconfPayload.clear();

  autoconfPayload["device"] = device.as<JsonObject>();
  autoconfPayload["availability_topic"] = MQTT_TOPIC_AVAILABILITY;
  autoconfPayload["state_topic"] = MQTT_TOPIC_STATE;
  autoconfPayload["command_topic"] = MQTT_TOPIC_COMMAND;
  autoconfPayload["name"] = BOARD_ID + String(" LED");
  autoconfPayload["value_template"] = "{{value_json.led}}";
  autoconfPayload["unique_id"] = BOARD_ID + String("_led");
  autoconfPayload["payload_on"] = "{\"led\": \"on\"}";
  autoconfPayload["payload_off"] = "{\"led\": \"off\"}";
  autoconfPayload["state_on"] = "on";
  autoconfPayload["state_off"] = "off";
  autoconfPayload["icon"] = "mdi:led-outline";
  autoconfPayload["entity_category"] = "config";

  serializeJson(autoconfPayload, mqttPayload);
  sendMQTTMessage(MQTT_TOPIC_AUTOCONF_LED_SWITCH, mqttPayload, true);

  autoconfPayload.clear();

  autoconfPayload["device"] = device.as<JsonObject>();
  autoconfPayload["availability_topic"] = MQTT_TOPIC_AVAILABILITY;
  autoconfPayload["name"] = BOARD_ID + String(" Humidifier");
  autoconfPayload["unique_id"] = BOARD_ID + String("_humidifier");
  autoconfPayload["device_class"] = "humidifier";

