kopiro/esp8266-deerma-humidifier/src/main.cpp
  autoconfPayload["max_humidity"] = 99;
  autoconfPayload["min_humidity"] = 0;

  autoconfPayload["state_topic"] = MQTT_TOPIC_STATE;
  autoconfPayload["state_value_template"] =
      "{\"state\": \"{{value_json.state}}\"}";
  autoconfPayload["payload_on"] = "{\"state\": \"on\"}";
  autoconfPayload["payload_off"] = "{\"state\": \"off\"}";
  autoconfPayload["command_topic"] = MQTT_TOPIC_COMMAND;
  autoconfPayload["state_value_template"] =
      "{\"state\": \"{{value_json.state}}\"}";
  autoconfPayload["payload_on"] = "{\"state\": \"on\"}";
  autoconfPayload["payload_off"] = "{\"state\": \"off\"}";

  StaticJsonDocument<64> modesDoc;
  JsonArray modes = modesDoc.to<JsonArray>();

  autoconfPayload["target_humidity_state_topic"] = MQTT_TOPIC_STATE;
  autoconfPayload["target_humidity_command_topic"] = MQTT_TOPIC_COMMAND;
  autoconfPayload["target_humidity_state_template"] =
      "{{value_json.humiditySetpoint | int}}";
  autoconfPayload["target_humidity_command_template"] =
      "{\"humiditySetpoint\": {{value | int}}}";

  modes.add("setpoint");
  modes.add("low");
  modes.add("medium");
  modes.add("high");

  autoconfPayload["modes"] = modes;
  autoconfPayload["mode_state_topic"] = MQTT_TOPIC_STATE;
  autoconfPayload["mode_command_topic"] = MQTT_TOPIC_COMMAND;
  autoconfPayload["mode_state_template"] = "{{value_json.mode}}";
  autoconfPayload["mode_command_template"] = "{\"mode\": \"{{value}}\"}";

  serializeJson(autoconfPayload, mqttPayload);
  sendMQTTMessage(MQTT_TOPIC_AUTOCONF_HUMIDIFIER, mqttPayload, true);
}

char serialRxBuf[255];
char serialTxBuf[255];

boolean DebugEnabled = false;
boolean UARTEnabled = true;

#define PROP_POWER_SIID 2
#define PROP_POWER_PIID 1

#define PROP_READ_SIID 3
#define PROP_HUMIDITY_PIID 1
#define PROP_TEMPERATURE_PIID 7

#define PROP_SET_SIID 2
#define PROP_HUMIDITY_MODE_PIID 5
#define PROP_HUMIDITY_SETPOINT_PIID 6

#define PROP_SOUND_SIID 5
#define PROP_SOUND_ENABLED_PIID 1

#define PROP_LED_SIID 6
#define PROP_LED_ENABLED_PIID 1

#define PROP_WATER_TANK_SIID 7
#define PROP_WATER_TANK_EMPTY_PIID 1
#define PROP_WATER_TANK_REMOVED_PIID 2

const int DOWNSTREAM_QUEUE_SIZE = 50;
const int DOWNSTREAM_QUEUE_ELEM_SIZE = 51;

char downstreamQueue[DOWNSTREAM_QUEUE_SIZE][DOWNSTREAM_QUEUE_ELEM_SIZE];
int downstreamQueueIndex = -1;
char nextDownstreamMessage[DOWNSTREAM_QUEUE_ELEM_SIZE] = "";

void saveConfig() {
  SerialDebug.println("Saving config...");

  DynamicJsonDocument json(512);
  json["mqtt_server"] = mqtt_server;
  json["mqtt_username"] = mqtt_username;
  json["mqtt_password"] = mqtt_password;

  File configFile = SPIFFS.open("/config.json", "w");
  if (!configFile) {
    SerialDebug.println("Failed to open config file for writing");
    return;
  }

  SerialDebug.printf("Saving JSON: %s\n", json.as<String>().c_str());

  serializeJson(json, configFile);
  configFile.close();

  Serial.printf("Saved JSON: %s", json.as<String>().c_str());
}

void loadConfig() {
  SerialDebug.println("Loading config");

  if (!SPIFFS.begin()) {
    SerialDebug.println("Failed to open SPIFFS");
    return;
  }

  if (!SPIFFS.exists("/config.json")) {
    SerialDebug.println("Config file not found, please configure the ESP by "
                        "connecting to its Wi-Fi hotspot");
    return;
  }

  File configFile = SPIFFS.open("/config.json", "r");
  if (!configFile) {
    SerialDebug.println("Failed to open config file");
    return;
  }

  const size_t size = configFile.size();
  std::unique_ptr<char[]> buf(new char[size]);

  configFile.readBytes(buf.get(), size);
  DynamicJsonDocument json(512);

  if (DeserializationError::Ok != deserializeJson(json, buf.get())) {
    SerialDebug.println("Failed to parse config fileDebug");
    return;
  }

  strncpy(mqtt_server, json["mqtt_server"].as<const char*>(), 63);
  strncpy(mqtt_username, json["mqtt_username"].as<const char*>(), 63);
  strncpy(mqtt_password, json["mqtt_password"].as<const char*>(), 63);

  wifi_param_mqtt_server.setValue(mqtt_server, 64);
  wifi_param_mqtt_username.setValue(mqtt_username, 64);
  wifi_param_mqtt_password.setValue(mqtt_password, 64);

  SerialDebug.printf("Config JSON: %s\n", json.as<String>().c_str());
}

void setupMDNS() {
  if (MDNS.begin(BOARD_ID)) {
    SerialDebug.println("MDNS responder started");
  } else {
    SerialDebug.println("MDNS responder got an error");
  }
}

void setupGeneric() {
  SerialDebug.begin(9600);
  SerialDebug.println("BOOT");

  pinMode(STATUS_PIN, OUTPUT);
  digitalWrite(STATUS_PIN, HIGH);

  pinMode(FLASH_PIN, INPUT_PULLUP);

  BOARD_ID = String(BOARD_PREFIX) + "-" + String(ESP.getChipId(), HEX);
  SerialDebug.printf("Board Identifier: %s\n", BOARD_ID.c_str());

  MQTT_TOPIC_STATE = BOARD_ID + "/state";
  MQTT_TOPIC_COMMAND = BOARD_ID + "/command";
  MQTT_TOPIC_DEBUG = BOARD_ID + "/debug";
  MQTT_TOPIC_AVAILABILITY = BOARD_ID + "/availability";

  // Home Assistant auto-discovery topics
  MQTT_TOPIC_AUTOCONF_TEMPERATURE_SENSOR = String("homeassistant/sensor/") +
                                           BOARD_ID +
                                           "/temperature/config";
  MQTT_TOPIC_AUTOCONF_HUMIDITY_SENSOR =
      String("homeassistant/sensor/") + BOARD_ID + "/humidity/config";
  MQTT_TOPIC_AUTOCONF_WIFI_SENSOR =
      String("homeassistant/sensor/") + BOARD_ID + "/wifi/config";
  MQTT_TOPIC_AUTOCONF_WATER_TANK_SENSOR =
      String("homeassistant/binary_sensor/") + BOARD_ID +
      "/water_tank/config";
  MQTT_TOPIC_AUTOCONF_HUMIDIFIER =
      String("homeassistant/switch/") + BOARD_ID + "/humidifier/config";
  MQTT_TOPIC_AUTOCONF_SOUND_SWITCH =
      String("homeassistant/switch/") + BOARD_ID + "/sound/config";
  MQTT_TOPIC_AUTOCONF_LED_SWITCH =
      String("homeassistant/switch/") + BOARD_ID + "/led/config";

  loadConfig();
}

void setupWifi() {
  if (WiFi.status() == WL_NO_SHIELD) {
    SerialDebug.println("WiFi shield not present");
    return;
  }

  WiFi.hostname(BOARD_ID);

  wifiManager.setConfigPortalBlocking(false);
  wifiManager.setDebugOutput(false);
  wifiManager.setSaveParamsCallback(saveConfig);

  wifiManager.addParameter(&wifi_param_mqtt_server);
  wifiManager.addParameter(&wifi_param_mqtt_username);
  wifiManager.addParameter(&wifi_param_mqtt_password);

